Revit 2027 API
ParameterTypeId.StairsAttrRiserTreadConnect Property
 "Riser to Tread Connection"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId StairsAttrRiserTreadConnect { get; }
Public Shared ReadOnly Property StairsAttrRiserTreadConnect As ForgeTypeId
	Get
public:
static property ForgeTypeId^ StairsAttrRiserTreadConnect {
	ForgeTypeId^ get ();
}
static member StairsAttrRiserTreadConnect : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
ParameterTypeId Class
Autodesk.Revit.DB Namespace